As a healthcare data scientist, I spend lots of time in data manipulation before applying machine learning models to solve the 'big' business questions. For example, it is common to integrate different data resources like Electronic Medical Records(EMR), claim data and digital sensor data together. Cleaning raw data and join different tables are important components of everyday work. Pandas is a very powerful package for data manipulation in Python. In this article, I will summarize some pandas skills for commonly data manipulation questions. In total, there are 12 parts in total. In Part I, I will firstly introduce the following 3 parts:

- Data Structure
- Basic Functions
- Missing Value

## Data Structure: Series and Dataframe

Before entering the hard part, let me firstly introduce the basic structure in pandas.There are two main structure in pandas: series and dataframe.

**Load Packages**

In [2]:
import numpy as np
import pandas as pd

### Series

Series is one-dimensional array with name and index. The data type in series can be int,float,string or object. Now let's create a series for age

In [4]:
Age = pd.Series(data=[18, 30, 55, 66])
Age

0    18
1    30
2    55
3    66
dtype: int64

We can also create a index as group name to match the age value here.

In [5]:
Age.index = ["A", "B", "C", "D"]
Age

A    18
B    30
C    55
D    66
dtype: int64

For index, we can create a name for index

In [8]:
Age.index.name = "name"
Age

name
A    18
B    30
C    55
D    66
Name: Age_info, dtype: int64

Similarly, we can create a name for series

In [7]:
Age.name="Age_info"
Age

group_name
A    18
B    30
C    55
D    66
Name: Age_info, dtype: int64

In general, a series includes data, index and name. Next we can use two lines to generate the results above.

In [9]:
# generate index
name = pd.Index(["A", "B", "C", "D"], name="name")
# 构建 Series
Age = pd.Series(data=[18, 30, 55, 66], index=name, name="Age_info")
Age

name
A    18
B    30
C    55
D    66
Name: Age_info, dtype: int64

If we don't specify data type, pandas will automatically assign the data type. But we can manually do that ourselves.

In [10]:
# data type is float
Age = pd.Series(data=[18, 30, 55, 66], index=name, name="Age_info", dtype=float)
Age

name
A    18.0
B    30.0
C    55.0
D    66.0
Name: Age_info, dtype: float64

Series is like dictionary in python. The index is like the key in dictionary.  For example, we want to get the age in A group

In [14]:
Age['A'] # "A" and 'A' are both Ok

18.0

In addition, we can use get function. When index doesn't exist, there will not be error

In [15]:
Age.get("A")

18.0

Series is also like ndarray. We can slice them.

In [16]:
#Get the first element
Age[0]

18.0

In [17]:
#Get the first three elements
Age[:3]

name
A    18.0
B    30.0
C    55.0
Name: Age_info, dtype: float64

In [18]:
#get the age larger than 30
Age[Age > 30]

name
C    55.0
D    66.0
Name: Age_info, dtype: float64

In [19]:
# get the second and forth elements
Age[[1, 3]]

name
B    30.0
D    66.0
Name: Age_info, dtype: float64

Like ndarray, we can do vector calculation

In [20]:
Age+1

name
A    19.0
B    31.0
C    56.0
D    67.0
Name: Age_info, dtype: float64

In [21]:
np.exp(Age)

name
A    6.565997e+07
B    1.068647e+13
C    7.694785e+23
D    4.607187e+28
Name: Age_info, dtype: float64

### DataFrame

There are two main ways to generate dataframe, the first one is to create a dictionary and then transform to data frame.

In [23]:
index = pd.Index(data=["A", "B", "C", "D"], name="name")

data = {
    "age": [18, 30, 55, 66],
    "State": ["Texas", "Iowa", "Minnesota", "Alabama"]
}

Patient = pd.DataFrame(data=data, index=index)
Patient

      age      State
name
A      18      Texas
B      30       Iowa
C      55  Minnesota
D      66    Alabama

In [24]:
Patient.reset_index()

  name  age      State
0    A   18      Texas
1    B   30       Iowa
2    C   55  Minnesota
3    D   66    Alabama

Another way to build a dataframe is as followings

In [25]:
data = [[18, "Texas"], 
        [30, "Iowa"], 
        [55, "Minnesota"], 
        [66, "Alabama"]]
columns = ["age", "State"]

Patient = pd.DataFrame(data=data, index=index, columns=columns)
Patient

      age      State
name
A      18      Texas
B      30       Iowa
C      55  Minnesota
D      66    Alabama

### Get the row records

**Get one row by index**

In [28]:
Patient.loc["A"]

age         18
State    Texas
Name: A, dtype: object

**Get one row by location**

In [29]:
Patient.iloc[0]

age         18
State    Texas
Name: A, dtype: object

**Get mutiple rows by location**

In [30]:
Patient.iloc[1:3]

      age      State
name
B      30       Iowa
C      55  Minnesota

### Get the column records

In [31]:
Patient.age

name
A    18
B    30
C    55
D    66
Name: age, dtype: int64

In [32]:
Patient['age']

name
A    18
B    30
C    55
D    66
Name: age, dtype: int64

In [33]:
Patient[["State", "age"]]

          State  age
name
A         Texas   18
B          Iowa   30
C     Minnesota   55
D       Alabama   66

In [34]:
Patient[["age","State"]]

      age      State
name
A      18      Texas
B      30       Iowa
C      55  Minnesota
D      66    Alabama

### Add/Remove Columns

**Add one column**

In [41]:
Patient["gender"] = "female"
Patient

      age      State  gender
name
A      18      Texas  female
B      30       Iowa  female
C      55  Minnesota  female
D      66    Alabama  female

In [42]:
Patient["gender"] = ["male", "male", "female", "male"]
Patient

      age      State  gender
name
A      18      Texas    male
B      30       Iowa    male
C      55  Minnesota  female
D      66    Alabama    male

**assign function to generate or change features**

In [40]:
Patient.assign(age_plus_one = Patient["age"] + 1)

      age      State  age_plus_one
name
A      18      Texas            19
B      30       Iowa            31
C      55  Minnesota            56
D      66    Alabama            67

In [43]:
Patient.assign(gender_cate = np.where(Patient["gender"] == "male", 1, 0))

      age      State  gender  gender_cate
name
A      18      Texas    male            1
B      30       Iowa    male            1
C      55  Minnesota  female            0
D      66    Alabama    male            1

**pop function to delete column**

In [44]:
Patient.pop("gender")
Patient

      age      State
name
A      18      Texas
B      30       Iowa
C      55  Minnesota
D      66    Alabama

## Basic Functions

In [45]:
index = pd.Index(data=["A", "B", "C", "D"], name="name")

data = {
    "age": [18, 30, 55, 66],
    "State": ["Texas", "Iowa", "Minnesota", "Alabama"],
    "gender": ["male", "male", "female", "male"]
}

Patient = pd.DataFrame(data=data, index=index)
Patient

      age      State  gender
name
A      18      Texas    male
B      30       Iowa    male
C      55  Minnesota  female
D      66    Alabama    male

When we have a dataframe, info()/decribe() is used to tell us the basic information of the dataframe

In [46]:
Patient.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, A to D
Data columns (total 3 columns):
age       4 non-null int64
State     4 non-null object
gender    4 non-null object
dtypes: int64(1), object(2)
memory usage: 128.0+ bytes

In [54]:
Patient.describe() #only include continuous variable

            age
count   4.00000
mean   42.25000
std    22.09638
min    18.00000
25%    27.00000
50%    42.50000
75%    57.75000
max    66.00000

In [55]:
Patient.describe(include=["object"])

        State gender
count       4      4
unique      4      2
top     Texas   male
freq        1      3

.T can be used for transpose dataframe

In [47]:
Patient.T

name        A     B          C        D
age        18    30         55       66
State   Texas  Iowa  Minnesota  Alabama
gender   male  male     female     male

.values can transform dataframe to ndarray

In [48]:
Patient.values

array([[18, 'Texas', 'male'],
       [30, 'Iowa', 'male'],
       [55, 'Minnesota', 'female'],
       [66, 'Alabama', 'male']], dtype=object)

### Description and summary statistics

**Get the max/min of column**

In [50]:
print(Patient.age.max(),Patient.age.min())

66 18

**cumsum()**

In [51]:
Patient.age.cumsum()

name
A     18
B     48
C    103
D    169
Name: age, dtype: int64

In [52]:
Patient.gender.cumsum()

name
A                  male
B              malemale
C        malemalefemale
D    malemalefemalemale
Name: gender, dtype: object

**value_counts()**

In [56]:
Patient.gender.value_counts()

male      3
female    1
Name: gender, dtype: int64

**idxmax()/idxmin() find the max/min index**

In [59]:
Patient.age.idxmax()

'D'

In [60]:
Patient.age.idxmin()

'A'

### Change continuous to categorical variables

In [61]:
pd.cut(Patient.age, 3)

name
A    (17.952, 34.0]
B    (17.952, 34.0]
C      (50.0, 66.0]
D      (50.0, 66.0]
Name: age, dtype: category
Categories (3, interval[float64]): [(17.952, 34.0] < (34.0, 50.0] < (50.0, 66.0]]

In [64]:
pd.cut(Patient.age, [1, 18, 30, 55,70])

name
A     (1, 18]
B    (18, 30]
C    (30, 55]
D    (55, 70]
Name: age, dtype: category
Categories (4, interval[int64]): [(1, 18] < (18, 30] < (30, 55] < (55, 70]]

In [65]:
pd.cut(Patient.age, [1, 18, 30, 55,70], labels=["childhood", "youth", "middle","old"])

name
A    childhood
B        youth
C       middle
D          old
Name: age, dtype: category
Categories (4, object): [childhood < youth < middle < old]

cut() function cut the value, while qcut() use the counts to categorize the variable

In [66]:
pd.qcut(Patient.age, 3)

name
A    (17.999, 30.0]
B    (17.999, 30.0]
C      (30.0, 55.0]
D      (55.0, 66.0]
Name: age, dtype: category
Categories (3, interval[float64]): [(17.999, 30.0] < (30.0, 55.0] < (55.0, 66.0]]

### Order the index and columns

In [67]:
Patient.sort_index()

      age      State  gender
name
A      18      Texas    male
B      30       Iowa    male
C      55  Minnesota  female
D      66    Alabama    male

In [68]:
Patient.sort_index(axis=1, ascending=False) ## From max to min

      gender  age      State
name
A       male   18      Texas
B       male   30       Iowa
C     female   55  Minnesota
D       male   66    Alabama

In [70]:
Patient.sort_index(ascending=False)

      age      State  gender
name
D      66    Alabama    male
C      55  Minnesota  female
B      30       Iowa    male
A      18      Texas    male

In [71]:
Patient.sort_values(by="age")

      age      State  gender
name
A      18      Texas    male
B      30       Iowa    male
C      55  Minnesota  female
D      66    Alabama    male

In [72]:
Patient.sort_values(by=["age", "State"])

      age      State  gender
name
A      18      Texas    male
B      30       Iowa    male
C      55  Minnesota  female
D      66    Alabama    male

### Get the largest or smallest n values

In [73]:
Patient.age.nlargest(2)

name
D    66
C    55
Name: age, dtype: int64

In [74]:
Patient.age.nsmallest(2)

name
A    18
B    30
Name: age, dtype: int64

### Function Application

**map()**

map is used for series

In [75]:
State_map = {
    "Texas": "High",
    "Iowa": "Low",
    "Minnesota": "High",
    "Alabama": "Low"
}
 

Patient.State.map(State_map)

name
A    High
B     Low
C    High
D     Low
Name: State, dtype: object

In [76]:
Patient.age.map(lambda x: "yes" if x >= 30 else "no")

name
A     no
B    yes
C    yes
D    yes
Name: age, dtype: object

In [77]:
#Used for find the max of each column or row
Patient.apply(lambda x: x.max(), axis=0)

age          66
State     Texas
gender     male
dtype: object

**applymap()**

applymap is used for dataframe

In [79]:
Patient.applymap(lambda x: str(x).lower())

     age      State  gender
name
A     18      texas    male
B     30       iowa    male
C     55  minnesota  female
D     66    alabama    male

### Change the feature/index names

In [80]:
Patient.rename(columns={"age": "Age", "State": "state", "gender": "Gender"})

      Age      state  Gender
name
A      18      Texas    male
B      30       Iowa    male
C      55  Minnesota  female
D      66    Alabama    male

In [81]:
Patient.rename(index={"A": "a", "B": "b"})

      age      State  gender
name
a      18      Texas    male
b      30       Iowa    male
C      55  Minnesota  female
D      66    Alabama    male

###  Data types

In [82]:
Patient.get_dtype_counts()

/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:1: FutureWarning: `get_dtype_counts` has been deprecated and will be removed in a future version. For DataFrames use `.dtypes.value_counts()
  """Entry point for launching an IPython kernel.

int64     1
object    2
dtype: int64

In [83]:
Patient["age"].astype(float)

name
A    18.0
B    30.0
C    55.0
D    66.0
Name: age, dtype: float64

### Change Data Type

In [84]:
Patient["height"] = ["178", "168", "178", "180cm"]
Patient

      age      State  gender height
name
A      18      Texas    male    178
B      30       Iowa    male    168
C      55  Minnesota  female    178
D      66    Alabama    male  180cm

In [85]:
pd.to_numeric(Patient.height, errors="coerce")

name
A    178.0
B    168.0
C    178.0
D      NaN
Name: height, dtype: float64

In [86]:
pd.to_numeric(Patient.height, errors="ignore")

name
A      178
B      168
C      178
D    180cm
Name: height, dtype: object

## Missing Value

In this session, we will talk about finding missing value, drop missing value, impute the missing value and replace missing value

In [113]:
index = pd.Index(data=["A", "B", "C", "D", "E", "F"], name="name")
 
data = {
    "age": [18, 30, np.nan, 40, np.nan, 55],
    "state": ["Texas", "Iowa", "Minnesota", "Alabama", np.nan, " "],
    "gender": [None, "male", "female", "male", np.nan, "unknown"],
    "birth": ["2000-02-10", "1988-07-17", None, "1978-08-08", np.nan, "1988-10-22"]
}
 
Patient= pd.DataFrame(data=data, index=index)
 
# Make the birth the date format
Patient["birth"] = pd.to_datetime(Patient.birth)
Patient

       age      state   gender      birth
name
A     18.0      Texas     None 2000-02-10
B     30.0       Iowa     male 1988-07-17
C      NaN  Minnesota   female        NaT
D     40.0    Alabama     male 1978-08-08
E      NaN        NaN      NaN        NaT
F     55.0             unknown 1988-10-22

There are ' ', Nan and NaT missing values

### Find the missing values

In [94]:
Patient.isnull()

        age  state  gender  birth
name
A     False  False    True  False
B     False  False   False  False
C      True  False   False   True
D     False  False   False  False
E      True   True    True   True
F     False  False   False  False

In [95]:
Patient[Patient.age.notnull()]

       age    state   gender      birth
name
A     18.0    Texas     None 2000-02-10
B     30.0     Iowa     male 1988-07-17
D     40.0  Alabama     male 1978-08-08
F     55.0           unknown 1988-10-22

### Drop missing values

In [96]:
Patient.age.dropna()

name
A    18.0
B    30.0
D    40.0
F    55.0
Name: age, dtype: float64

There are several option you can choose

- axis=0 is for rows,axis=1 is for columns
- how:any or all. any means we drop column/row with >=1 missing value, all means we drop column/row when all are missing
- subset apply for specific features or index
- thresh. For example, if thresh=2 means at least 2 are not missing

In [97]:
# if one row has missing, we delete the rows
Patient.dropna(axis=0, how="any")

       age    state   gender      birth
name
B     30.0     Iowa     male 1988-07-17
D     40.0  Alabama     male 1978-08-08
F     55.0           unknown 1988-10-22

In [98]:
Patient.dropna(axis=0, how="all")

       age      state   gender      birth
name
A     18.0      Texas     None 2000-02-10
B     30.0       Iowa     male 1988-07-17
C      NaN  Minnesota   female        NaT
D     40.0    Alabama     male 1978-08-08
F     55.0             unknown 1988-10-22

In [99]:
#if rows on state and gender has missing, we delete the rows
Patient.dropna(axis=0, how="any", subset=["state", "gender"])

       age      state   gender      birth
name
B     30.0       Iowa     male 1988-07-17
C      NaN  Minnesota   female        NaT
D     40.0    Alabama     male 1978-08-08
F     55.0             unknown 1988-10-22

### Impute the missing value

In [100]:
Patient.age.fillna(0)

name
A    18.0
B    30.0
C     0.0
D    40.0
E     0.0
F    55.0
Name: age, dtype: float64

We can also use forward fill and backward fill for missing value

In [101]:
Patient.age

name
A    18.0
B    30.0
C     NaN
D    40.0
E     NaN
F    55.0
Name: age, dtype: float64

In [102]:
Patient.age.fillna(method="ffill")

name
A    18.0
B    30.0
C    30.0
D    40.0
E    40.0
F    55.0
Name: age, dtype: float64

In [103]:
Patient.age.fillna(method="bfill")

name
A    18.0
B    30.0
C    40.0
D    40.0
E    55.0
F    55.0
Name: age, dtype: float64

interpolate is another way to impiute the data, we use the method for some time series data. You can do linear or polynomial. In Pandas, the default is linear

In [104]:
Patient.age.interpolate()

name
A    18.0
B    30.0
C    35.0
D    40.0
E    47.5
F    55.0
Name: age, dtype: float64

### Replace the missing values

In [105]:
Patient.age.replace(40, np.nan)

name
A    18.0
B    30.0
C     NaN
D     NaN
E     NaN
F    55.0
Name: age, dtype: float64

In [106]:
Patient.age.replace({40: np.nan})

name
A    18.0
B    30.0
C     NaN
D     NaN
E     NaN
F    55.0
Name: age, dtype: float64

In [107]:
Patient.replace({"age": 40, "birth": pd.Timestamp("1978-08-08")}, np.nan)

       age      state   gender      birth
name
A     18.0      Texas     None 2000-02-10
B     30.0       Iowa     male 1988-07-17
C      NaN  Minnesota   female        NaT
D      NaN    Alabama     male        NaT
E      NaN        NaN      NaN        NaT
F     55.0             unknown 1988-10-22

In [108]:
Patient.gender.replace("unknown", np.nan)

name
A      None
B      male
C    female
D      male
E       NaN
F       NaN
Name: gender, dtype: object

We can change space to NA as followings

In [109]:
Patient.state.replace(r'\s+', np.nan, regex=True)

name
A        Texas
B         Iowa
C    Minnesota
D      Alabama
E          NaN
F          NaN
Name: state, dtype: object

We can also use other column to impute current column. For example we have two age columns, one of them has missing value while the other one has no missing value.

In [111]:
age_new = Patient.age.copy()
age_new.fillna(20, inplace=True)
age_new

name
A    18.0
B    30.0
C    20.0
D    40.0
E    20.0
F    55.0
Name: age, dtype: float64

In [112]:
Patient.age.combine_first(age_new)

name
A    18.0
B    30.0
C    20.0
D    40.0
E    20.0
F    55.0
Name: age, dtype: float64

The missing value is age is imputed by the value from age_new